Tekla Open API Reference for Tekla Structures 2025
Profile Methods
The Profile type exposes the following members.
Methods
Name | Description
FormatProfileString
 Formats profile string
ParseProfileString
 Parses profile string
Top
See Also
Reference
Profile Class
Tekla.Structures.Model Namespace